#ifndef __GALE01_09F7F8
#define __GALE01_09F7F8

#include <placeholder.h>

struct _m2c_stack_ftCo_8009F834 {
    /* 0x00 */ char pad_0[0x7C];
    /* 0x7C */ f32 sp7C; /* inferred */
    /* 0x80 */ f32 sp80; /* inferred */
    /* 0x84 */ f32 sp84; /* inferred */
    /* 0x88 */ f32 sp88; /* inferred */
    /* 0x8C */ f32 sp8C; /* inferred */
    /* 0x90 */ f32 sp90; /* inferred */
    /* 0x94 */ f32 sp94; /* inferred */
    /* 0x98 */ f32 sp98; /* inferred */
    /* 0x9C */ f32 sp9C; /* inferred */
    /* 0xA0 */ f32 spA0; /* inferred */
    /* 0xA4 */ f32 spA4; /* inferred */
    /* 0xA8 */ f32 spA8; /* inferred */
    /* 0xAC */ f32 spAC; /* inferred */
    /* 0xB0 */ f32 spB0; /* inferred */
    /* 0xB4 */ char pad_B4[0x1C];
}; /* size = 0xD0 */

#endif
